app/controllers/events_controller.rb

INSERT INTO "events" ("created_at", "date", "description", "title", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "events" SET "description" = 'Huge Birthday Bash for the birthday boy''s 31st birthday. Refreshments will be served.
---
  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])